R_Sorting_Code/sorting_with_r.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2016-12-08 jeu. 20:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Functions Sorting with R</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Christophe Pouzat" />
</head>
<body>
<div id="content">
<h1 class="title">Functions Sorting with R</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgac35772">1. Introduction</a></li>
<li><a href="#org7ff165a">2. Custom developed code</a>
<ul>
<li><a href="#org8d16c8b">2.1. Individual function definitions</a>
<ul>
<li><a href="#org092ac03">2.1.1. <code>cstValueSgts</code> definition</a></li>
<li><a href="#org913c8ab">2.1.2. Definitions of generic function and time-series specific method for data exploration</a></li>
<li><a href="#org42d015c">2.1.3. <code>peaks</code> and associated methods definition</a></li>
<li><a href="#org3b39c3a">2.1.4. Definition of an <code>explore</code> method for time series and <code>eventsPos</code> objects</a></li>
<li><a href="#org6d8f751">2.1.5. Function <code>cutSglEvt</code></a></li>
<li><a href="#org55443e3">2.1.6. Function <code>mkEvents</code></a></li>
<li><a href="#org949c75e">2.1.7. <code>events</code> methods</a></li>
<li><a href="#orgf01ff42">2.1.8. <code>mkNoise</code> definition</a></li>
<li><a href="#org2979fa9">2.1.9. Definition of an <code>explore</code> method for <code>pca</code> results</a></li>
<li><a href="#org0f10f85">2.1.10. Definition of <code>get_jitter</code></a></li>
<li><a href="#orgb00920e">2.1.11. Definition of <code>mk_aligned_events</code></a></li>
<li><a href="#orgaaf9f29">2.1.12. Definition of <code>mk_center_list</code></a></li>
<li><a href="#orgb10176c">2.1.13. Definition of <code>classify_and_align_evt</code></a></li>
<li><a href="#org785a74d">2.1.14. Definition of <code>predict_data</code></a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgac35772" class="outline-2">
<h2 id="orgac35772"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
This file contains function definitions and documentation.
</p>
</div>
</div>

<div id="outline-container-org7ff165a" class="outline-2">
<h2 id="org7ff165a"><span class="section-number-2">2</span> Custom developed code</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-org8d16c8b" class="outline-3">
<h3 id="org8d16c8b"><span class="section-number-3">2.1</span> Individual function definitions</h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-org092ac03" class="outline-4">
<h4 id="org092ac03"><span class="section-number-4">2.1.1</span> <code>cstValueSgts</code> definition</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
Formal parameters:
</p>
<ul class="org-ul">
<li><code>x</code>: a numeric vector.</li>
</ul>
<p>
Returns: an intgeger matrix with as many columns as segments where the derivative is null, the first row contains the index of the beginning of each segment, the second row contains the segments' lengths.
</p>
<div class="org-src-container">
<pre class="src src-R" id="orgb044b78">cstValueSgts &lt;- function(x) {
    dx &lt;- as.integer(abs(diff(x,2))/2 &lt;= .Machine$double.eps) ## use "order 2" derivative estimates
    ## ddx is zero where the derivative did not change,
    ## it is one if the derivative becomes null and -1
    ## is the derivative stops being null
    ddx &lt;- diff(dx) 
    ## s contains the indexes of the first
    ## points of segments where the
    ## derivative is null
    s &lt;- (1:length(ddx))[ddx==1]
    sapply(s,
           function(b) {
               n &lt;- ddx[(b+1):length(ddx)]
               c(b+1,min((1:length(n))[n==-1]))
           }
           )
}
</pre>
</div>
</div>
</div>
