R_Sorting_Code/sorting_with_r.html

<div id="outline-container-org913c8ab" class="outline-4">
<h4 id="org913c8ab"><span class="section-number-4">2.1.2</span> Definitions of generic function and time-series specific method for data exploration</h4>
<div class="outline-text-4" id="text-2-1-2">
<p>
Definition of the generic function:
</p>
<div class="org-src-container">
<pre class="src src-R" id="orga1d9483">explore &lt;- function(x,...) {
  UseMethod("explore")
}
</pre>
</div>

<p>
Definition of the corresponding method for time series:
Formal arguments:
</p>
<ul class="org-ul">
<li><code>x</code>: a <code>ts</code> (time series) object.</li>
<li><code>offsetFactor</code>: a numeric controlling the the spacing between the recording sites on the plot. Smaller values lead to closer spacing.</li>
<li><code>...</code>: additional arguments passed to <code>matplot</code> and <code>plot</code> functions called inernally.</li>
</ul>
<div class="org-src-container">
<pre class="src src-R" id="orga17b57b">explore.ts &lt;- function(x,
                       offsetFactor=0.5, 
                       ...) {

    stopifnot(inherits(x,"ts"))
    yRange &lt;- range(x,na.rm=TRUE)
    plotPara &lt;- list(tlim = start(x)[1] + c(0,0.1),
                     ylim = yRange,
                     yMin = yRange[1],
                     yMax = yRange[2],
                     firstTime = start(x)[1],
                     lastTime = end(x)[1],
                     keepGoing = TRUE)
    
    nFct &lt;- function() {
        leftTime &lt;- plotPara$tlim[1]
        rightTime &lt;- plotPara$tlim[2]
        timeRange &lt;- rightTime - leftTime
        rightTime &lt;- rightTime + timeRange
        if (rightTime &gt; plotPara$lastTime) {
            cat("Recording end reached.\n ")
            rightTime &lt;- plotPara$lastTime
        }
        plotPara$tlim &lt;- c(rightTime - timeRange, rightTime)
        plotPara
    }
    fFct &lt;- function() {
        leftTime &lt;- plotPara$tlim[1]
        rightTime &lt;- plotPara$tlim[2]
        timeRange &lt;- rightTime - leftTime
        leftTime &lt;- leftTime - timeRange
        if (leftTime &lt; plotPara$firstTime) {
            cat("Recording end reached.\n ")
            leftTime &lt;- plotPara$firstTime
        }
        plotPara$tlim &lt;- c(leftTime, leftTime + timeRange)
        plotPara
    }
    qFct &lt;- function() {
        plotPara$keepGoing &lt;- FALSE
        plotPara
    }
    ## Function tFct definition
    ## Allows the user to change the recording duration displayed on the window
    ## The user is invited to enter a factor which will be used to multiply the
    ## present duration displayed.
    ## If the resulting duration is too long a warning is given and the whole
    ## recording is shown.
    ## If possible the center of the displayed window is conserved.
    tFct &lt;- function() {
        
        presentWindowLength &lt;- diff(range(plotPara$tlim))
        tMessage &lt;- paste("Present duration displayed: ", presentWindowLength, " \n", sep = "")
        tMessage &lt;- paste(tMessage,
                          "By what factor do you want to multiply it? \n", sep = "")
        
        theFactor &lt;- as.numeric(readline(tMessage))
        
        if (theFactor &lt;= 0) {
            cat("A negative or null factor does not make sense.\n")
            return(plotPara)
        } ## End of conditional on theFactor &lt;= 0
        
        ## Check that the new display length is reasonable
        totalLength &lt;- plotPara$lastTime - plotPara$firstTime
        if (theFactor * presentWindowLength &gt;= totalLength) {
            cat("Cannot show more data than available but only the entire record.\n ")
            plotPara$tlim[1] &lt;- plotPara$firstTime
            plotPara$tlim[2] &lt;- plotPara$lastTime
            return(plotPara)
        }

        windowCenter &lt;- plotPara$tlim[1] + presentWindowLength / 2
        newLeft &lt;- windowCenter - theFactor * presentWindowLength / 2
        newRight &lt;- windowCenter + theFactor * presentWindowLength / 2
        
        if (!(newLeft &gt;= plotPara$firstTime &amp; newRight &lt;= plotPara$lastTime)) {
            if (newLeft &lt;= plotPara$firstTime) {
                cat("Cannot show data before the recording started, the displayed center wont be conserved.\n ")
                plotPara$tlim[1] &lt;- plotPara$firstTime
                plotPara$tlim[2] &lt;- plotPara$tlim[1] + theFactor * presentWindowLength
            }
            if (newRight &gt;= plotPara$lastTime) {
                cat("Cannot show data after the recording ended, the displayed center wont be conserved.\n ")
                plotPara$tlim[2] &lt;- plotPara$lastTime
                plotPara$tlim[1] &lt;- plotPara$tlim[2] - theFactor * presentWindowLength
            }
            return(plotPara)
        } ## End of conditional on !(newLeft &gt;= plotPara$firstTime &amp; newRight &lt;= plotPara$lastTime)

        plotPara$tlim[1] &lt;- newLeft
        plotPara$tlim[2] &lt;- newRight
        return(plotPara)
        
    }
    ## End of function tFct definition

    ## Function rFct definition
    ## Allows the user to change the maximal value displayed on the abscissa
    ## The user is invited to enter a value.
    rFct &lt;- function() {
        
        leftTime &lt;- plotPara$tlim[1]
        rightTime &lt;- plotPara$tlim[2]
        timeRange &lt;- rightTime - leftTime
        tMessage &lt;- paste("Present latest time displayed: ",
                          rightTime,
                          "\n", sep = "")
        tMessage &lt;- paste(tMessage,
                          "What new latest time do want (return leaves things unchanged)? \n", sep = "")
        
        theNewTime &lt;- as.numeric(readline(tMessage))
        
        if (is.na(theNewTime)) { ## Nothing entered, leave things unchanged 
            return(plotPara)
        } ## End of conditional on is.na(theFactor)
        
        if (theNewTime &lt;= plotPara$firstTime) {
            ## This choice does not make sense
            cat("Cannot display data before recording started.\n")
            return(plotPara)
        }

        if (theNewTime &gt; plotPara$lastTime) {
            cat("Recording end reached.\n ")
            rightTime &lt;- plotPara$lastTime
        } else {
            if (theNewTime &lt;= leftTime) {
                ## The new latest time entered is smaller that the earliest time displayed
                cat("The new latest time is smaller than the earliest, adjustement will be made.\n")
                leftTime &lt;- theNewTime - timeRange
                if (leftTime &lt; plotPara$firstTime) {
                    cat("Adjustment requires a change in displayed duration.\n")
                    leftTime &lt;- plotPara$firstTime
                }
            } ## End of conditional on theNewTime &lt;= leftTime 
            rightTime &lt;- theNewTime
        } ## End of conditional on theNewTime &gt; plotPara$lastTime
        
        plotPara$tlim &lt;- c(leftTime, rightTime)
        plotPara
        
    }

    ## Function lFct definition
    ## Allows the user to change the minimal value displayed on the abscissa
    ## The user is invited to enter a value.
    lFct &lt;- function() {
        
        leftTime &lt;- plotPara$tlim[1]
        rightTime &lt;- plotPara$tlim[2]
        timeRange &lt;- rightTime - leftTime
        tMessage &lt;- paste("Present earliest time displayed: ",
                          leftTime,
                          "\n", sep = "")
        tMessage &lt;- paste(tMessage,
                          "What new earliest time do want (return leaves things unchanged)? \n", sep = "")
        
        theNewTime &lt;- as.numeric(readline(tMessage))
        
        if (is.na(theNewTime)) { ## Nothing entered, leave things unchanged 
            return(plotPara)
        } ## End of conditional on is.na(theFactor)
        
        if (theNewTime &gt;= plotPara$lastTime) {
            ## This choice does not make sense
            cat("Cannot display data after recording ended.\n")
            return(plotPara)
        }

        if (theNewTime &lt; plotPara$firstTime) {
            cat("Recording start reached.\n ")
            leftTime &lt;- plotPara$firstTime
        } else {
            if (theNewTime &gt;= rightTime) {
                ## The new earliest time entered is larger that the latest time displayed
                cat("The new earliest time is larger than the latest, adjustement will be made.\n")
                rightTime &lt;- theNewTime + timeRange
                if (rightTime &gt; plotPara$lastTime) {
                    cat("Adjustment requires a change in displayed duration.\n")
                    rightTime &lt;- plotPara$lastTime
                }
            } ## End of conditional on theNewTime &lt;= leftTime 
            leftTime &lt;- theNewTime
        } ## End of conditional on theNewTime &gt; plotPara$lastTime
        
        plotPara$tlim &lt;- c(leftTime, rightTime)
        plotPara
        
    }
    

    ## Function yMaxFct definition
    ## Allows the user to change the maximal value displayed on the ordinate
    ## The user is invited to enter a value.
    yMaxFct &lt;- function() {
        
        presentWindowRange &lt;- range(plotPara$ylim)
        tMessage &lt;- paste("Present range displayed: [",
                          paste(presentWindowRange, collapse = ","),
                          "] \n", sep = "")
        tMessage &lt;- paste(tMessage,
                          "What new maximal ordinate value do want (return goes back to maximum)? \n", sep = "")
        
        theFactor &lt;- as.numeric(readline(tMessage))

        if (is.na(theFactor)) {
            plotPara$ylim &lt;- c(presentWindowRange[1],plotPara$yMax) 
            return(plotPara)
        } ## End of conditional on is.na(theFactor)
        
        if (theFactor &lt;= plotPara$ylim[1]) {
            cat("The maximum should be larger than the minimum.\n")
            return(plotPara)
        } ## End of conditional on theFactor &lt;= plotPara$ylim[1]

        plotPara$ylim &lt;- c(presentWindowRange[1],theFactor) 
        return(plotPara)
        
    }
    ## End of function yMaxFct definition

    ## Function yMinFct definition
    ## Allows the user to change the minimal value displayed on the ordinate
    ## The user is invited to enter a value.
    yMinFct &lt;- function() {

        presentWindowRange &lt;- range(plotPara$ylim)
        tMessage &lt;- paste("Present range displayed: [",
                          paste(presentWindowRange, collapse = ","),
                          "] \n", sep = "")
        tMessage &lt;- paste(tMessage,
                          "What new minimal ordinate value do want (return goes back to minimum)? \n", sep = "")
        
        theFactor &lt;- as.numeric(readline(tMessage))

        if (is.na(theFactor)) {
            plotPara$ylim &lt;- c(plotPara$yMin, presentWindowRange[2]) 
            return(plotPara)
        } ## End of conditional on is.na(theFactor)
        
        if (theFactor &gt;= plotPara$ylim[2]) {
            cat("The minimum should be smaller than the maximum.\n")
            return(plotPara)
        } ## End of conditional on theFactor &gt;= plotPara$ylim[2]

        plotPara$ylim &lt;- c(theFactor, presentWindowRange[2]) 
        return(plotPara)
        
    }
    ## End of function yMinFct definition

    show &lt;- function(x,
                     plotPara,
                     ...) {

        s &lt;- plotPara$tlim[1]
        e &lt;- plotPara$tlim[2]
        y.m &lt;- plotPara$ylim[1]
        y.M &lt;- plotPara$ylim[2]
        m &lt;- unclass(window(x,start=s,end=e))
        if (class(m) == "matrix") {
            m &lt;- apply(m,2,function(x) ifelse(x &lt; y.m, y.m,x))
            m &lt;- apply(m,2,function(x) ifelse(x &gt; y.M, y.M,x))
            ns &lt;- dim(m)[2]
            offset &lt;- c(0,-(1:(ns-1))*(y.M-y.m))
            m &lt;- t(t(m)+offset*offsetFactor)
            matplot(m,type="l",lty=1,axes=FALSE,xlab="",ylab="",...)
        } else {
            m[m&lt;y.m] &lt;- y.m
            m[m&gt;y.M] &lt;- y.M
            plot(m,type="l",lty=1,axes=FALSE,xlab="",ylab="",ylim=c(y.m,y.M),...)
        }
    }

    plot.new()
    par(mar=c(0.5,0.5,0.5,0.5))
    show(x,plotPara,...)
    
    myMessage &lt;- "Make a choice:\n n or 'return' (next); f (former); l (lower abscissa limit); r (upper abscissa limit) \n t (time scale); Y (upper ordinate limit); y (lower ordinate limit); q (quit) \n "

    while(plotPara$keepGoing) {
        
        myChoice &lt;- readline(myMessage)

        plotPara &lt;- switch(myChoice,
                           n = nFct(),
                           f = fFct(),
                           l = lFct(),
                           r = rFct(),
                           t = tFct(),
                           Y = yMaxFct(),
                           y = yMinFct(),
                           q = qFct(),
                           nFct()
                           )

        show(x,plotPara,...)
        
    } ## End of while loop on keepGoing

    dev.off()
    invisible()
}
</pre>
</div>
</div>
</div>
