R_Sorting_Code/sorting_with_r.org
*** =peaks= and associated methods definition
Function =peaks= returns an object (essentially a vector of indices) of class =eventsPos=:
#+name: peaks-definition
#+BEGIN_SRC R
peaks <- function(x,
                  minimalDist=15,
                  notZero=1e-3) {
    dx <- c(0,diff(x,2)/2,0)
    dx[abs(dx) < notZero] <- 0
    dx <- diff(sign(dx))
    res <- (1:length(dx))[dx < 0]
    res <- res[-length(res)][diff(res) > minimalDist]
    attr(res,"call") <- match.call()
    attr(res,"nIDx") <- length(x)
    class(res) <- "eventsPos"
    res
}
#+END_SRC

#+RESULTS: peaks-definition

Method =as.eventsPos= transforms a vector into an =eventsPos= object, its formal arguments are:
+ =x=: an integer vector with strictly increasing elements.
+ =start=: an integer, the sampling point at which observation started.
+ =end=: an integer, the sampling point at which observation ended.
#+name: as.eventsPos
#+BEGIN_SRC R
as.eventsPos <- function(x,
                         start,
                         end
                         ) {
    x <- as.integer(x)
    stopifnot(all(diff(x)>0))
    if (missing(start)) start <- floor(x)
    if (missing(end)) end <- ceiling(x)
    stopifnot(all(x>=start))
    stopifnot(all(x<=end))
    attr(x,"call") <- match.call()
    attr(x,"nIDx") <- end-start+1
    class(x) <- "eventsPos"
    x
}
#+END_SRC

#+RESULTS: as.eventsPos

Method =print.eventsPos= prints an =eventsPos= object:
#+name: print.eventsPos
#+BEGIN_SRC R
print.eventsPos <- function(x, ...) {
  cat("\neventsPos object with indexes of ", length(x)," events. \n", sep = "")
  cat("  Mean inter event interval: ", round(mean(diff(x)),digits=2), " sampling points, corresponding SD: ", round(sd(diff(x)),digits=2), " sampling points \n", sep = "")
  cat("  Smallest and largest inter event intervals: ", paste(range(diff(x)),collapse=" and "), " sampling points. \n\n",sep= "")
}
#+END_SRC

#+RESULTS: print.eventsPos

