R_Sorting_Code/sorting_with_r.html

<div id="outline-container-org42d015c" class="outline-4">
<h4 id="org42d015c"><span class="section-number-4">2.1.3</span> <code>peaks</code> and associated methods definition</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
Function <code>peaks</code> returns an object (essentially a vector of indices) of class <code>eventsPos</code>:
</p>
<div class="org-src-container">
<pre class="src src-R" id="org7a9d142">peaks &lt;- function(x,
                  minimalDist=15,
                  notZero=1e-3) {
    dx &lt;- c(0,diff(x,2)/2,0)
    dx[abs(dx) &lt; notZero] &lt;- 0
    dx &lt;- diff(sign(dx))
    res &lt;- (1:length(dx))[dx &lt; 0]
    res &lt;- res[-length(res)][diff(res) &gt; minimalDist]
    attr(res,"call") &lt;- match.call()
    attr(res,"nIDx") &lt;- length(x)
    class(res) &lt;- "eventsPos"
    res
}
</pre>
</div>

<p>
Method <code>as.eventsPos</code> transforms a vector into an <code>eventsPos</code> object, its formal arguments are:
</p>
<ul class="org-ul">
<li><code>x</code>: an integer vector with strictly increasing elements.</li>
<li><code>start</code>: an integer, the sampling point at which observation started.</li>
<li><code>end</code>: an integer, the sampling point at which observation ended.</li>
</ul>
<div class="org-src-container">
<pre class="src src-R" id="org7f2af45">as.eventsPos &lt;- function(x,
                         start,
                         end
                         ) {
    x &lt;- as.integer(x)
    stopifnot(all(diff(x)&gt;0))
    if (missing(start)) start &lt;- floor(x)
    if (missing(end)) end &lt;- ceiling(x)
    stopifnot(all(x&gt;=start))
    stopifnot(all(x&lt;=end))
    attr(x,"call") &lt;- match.call()
    attr(x,"nIDx") &lt;- end-start+1
    class(x) &lt;- "eventsPos"
    x
}
</pre>
</div>

<p>
Method <code>print.eventsPos</code> prints an <code>eventsPos</code> object:
</p>
<div class="org-src-container">
<pre class="src src-R" id="orgea5b8e3">print.eventsPos &lt;- function(x, ...) {
  cat("\neventsPos object with indexes of ", length(x)," events. \n", sep = "")
  cat("  Mean inter event interval: ", round(mean(diff(x)),digits=2), " sampling points, corresponding SD: ", round(sd(diff(x)),digits=2), " sampling points \n", sep = "")
  cat("  Smallest and largest inter event intervals: ", paste(range(diff(x)),collapse=" and "), " sampling points. \n\n",sep= "")
}
</pre>
</div>
</div>
</div>
