R_Sorting_Code/sorting_with_r.html

<div id="outline-container-org6d8f751" class="outline-4">
<h4 id="org6d8f751"><span class="section-number-4">2.1.5</span> Function <code>cutSglEvt</code></h4>
<div class="outline-text-4" id="text-2-1-5">
<p>
Its formal parameters are:
</p>
<ul class="org-ul">
<li><code>evtPos</code>: a numeric or integer interpretable as an index, the posistion at which cuts will be produced.</li>
<li><code>data</code>: a numeric vector of matrix containing the data. If vector the argument is converted as a single column matrix internally. The matrix rows are indexed by sampling points and its columns by recording sites / channels.</li>
<li><code>before</code>: an integer: the number of sampling points within the cut before the reference time given by evtPos.</li>
<li><code>after</code>: an integer: the number of sampling points after the reference time.</li>
</ul>
<p>
It returns: 
</p>
<ul class="org-ul">
<li>A numeric vector with the cut(s). When several recording sites are used the cuts of each individual sites are placed one after the other.</li>
</ul>
<div class="org-src-container">
<pre class="src src-R" id="org2e00f16">cutSglEvt &lt;- function(evtPos,
                      data,
                      before=14,
                      after=30
                      ) {
    evtPos &lt;- as.integer(evtPos) ## make sure evtPos is an integer
    before &lt;- as.integer(before) ## make sure before is an integer
    stopifnot(0 &lt;= before) ## make sure before is positive or null
    after &lt;- as.integer(after)
    stopifnot(0 &lt;= after) ## make sure after is positive or null
    if (is.vector(data)) data &lt;- matrix(data,nc=1)
    ns &lt;- dim(data)[2]
    dl &lt;- dim(data)[1]
    stopifnot(0&lt;evtPos, evtPos&lt;=dl) ## make sure evtPos is within range
    sl &lt;- before+after+1 ## the length of the cut
    keep &lt;- -before:after + evtPos
    within &lt;- 1 &lt;= keep &amp; keep &lt;= dl
    kw &lt;- keep[within]
    res &lt;- sapply(1:ns,
                  function(idx) {
                      v &lt;- numeric(sl)
                      v[within] &lt;- data[kw,idx]
                      v
                  }
                  )
    as.vector(res)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org55443e3" class="outline-4">
<h4 id="org55443e3"><span class="section-number-4">2.1.6</span> Function <code>mkEvents</code></h4>
<div class="outline-text-4" id="text-2-1-6">
<p>
Its formal parameters are:
</p>
<ul class="org-ul">
<li><code>positions</code>: an integer vector with events' positions as indices / sampling points or an <code>eventsPos</code> object.</li>
<li><code>data</code>: a numeric vector of matrix containing the data or a 'ts' or 'mts' object. If vector the argument is converted as a single column matrix internally. The matrix rows are indexed by sampling points and its columns by recording sites / channels.</li>
<li><code>before</code>: an integer, the number of sampling points within the cut before the reference times given by <code>positions</code>.</li>
<li><code>after</code>: an integer, the number of sampling points within the cut after the reference times given by <code>positions</code>.</li>
</ul>
<p>
It returns a matrix with before + after + 1 rows and as many columns
as elements in positions. Each column is an "event", that is, a set of
cuts on the data. Attribute "positions" contains the value of the
argument with the same name and attribute "data" contains the name of
the corresponding argument, attribute "before" contains the value of
the argument with the same name, attribute "after" contains the value
of the argument with the same name, attribute "numberOfSites" contains
the number of recording sites. Attribute "delta" is used when events
are realligned on their mean waveforms (during "jitter
cancellation"). The returned matrix is given an "events" class.
</p>

<div class="org-src-container">
<pre class="src src-R" id="orga6a9ce8">mkEvents &lt;- function(positions,
                     data,
                     before=14,
                     after=30
                     ) {
    positions &lt;- unclass(positions)
    data &lt;- unclass(data)
    res &lt;- sapply(positions,
                  cutSglEvt,
                  data,
                  before,
                  after)
    the.call &lt;- match.call()
    attr(res,"positions") &lt;- positions
    attr(res,"delta") &lt;- NULL
    attr(res,"data") &lt;- the.call[["data"]]
    attr(res,"before") &lt;- before
    attr(res,"after") &lt;- after
    attr(res,"numberOfSites") &lt;- ifelse(is.matrix(data),dim(data)[2],1)
    attr(res,"call") &lt;- match.call()
    class(res) &lt;- "events"
    res
}
</pre>
</div>
</div>
</div>
