R_Sorting_Code/sorting_with_r.html

<div id="outline-container-org949c75e" class="outline-4">
<h4 id="org949c75e"><span class="section-number-4">2.1.7</span> <code>events</code> methods</h4>
<div class="outline-text-4" id="text-2-1-7">
<div class="org-src-container">
<pre class="src src-R" id="orgc52ea1b">summary.events &lt;- function(object,
                           ...) {
  b &lt;- attr(object,"before")
  a &lt;- attr(object,"after")
  ns &lt;- attr(object,"numberOfSites")
  cat("\nevents object deriving from data set: ",attr(object,"data"),".\n",sep="")
  cat(" Events defined as cuts of ", a+b+1, " sampling points on each of the ",ns, " recording sites.\n",sep="")
  cat(" The 'reference' time of each event is located at point ", b+1, " of the cut.\n",sep="")
  if (!is.null(attr(object,"delta"))) {
    cat(" Events were realigned on median event.\n",sep="")
  }
  cat(" There are ", length(attr(object,"positions")), " events in the object.\n\n",sep="")
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org24b0767">"[.events" &lt;- function(x,i,j,drop = FALSE) {
    y &lt;- NextMethod("[")
    if (!missing(i)) return(NULL)
    if (is.matrix(y) &amp;&amp; dim(y)[2] &gt; 1) {
        attr(y,"positions") &lt;- attr(x,"positions")[j]
        attr(y,"delta") &lt;- attr(x,"delta")
        attr(y,"data") &lt;- attr(x,"data")
        attr(y,"before") &lt;- attr(x,"before")
        attr(y,"after") &lt;- attr(x,"after")
        attr(y,"numberOfSites") &lt;- attr(x,"numberOfSites")
        attr(y,"call") &lt;- match.call()
        class(y) &lt;- "events"
    }
    y
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgfdc3c80">t.events &lt;- function(x) {
  t(unclass(x))
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org441266b">mean.events &lt;- function(x,...) {
    apply(unclass(x),1,mean,...)
}

median.events &lt;- function(x,na.rm = FALSE) {
    apply(unclass(x),1,median,na.rm)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="orgbbd02a8">'-.events' &lt;- function(e1,e2) {
    stopifnot(length(e2) == dim(e1)[1])
    res &lt;- unclass(e1)-e2
    attr(res,"positions") &lt;- attr(e1,"positions")
    attr(res,"delta") &lt;- attr(e1,"delta")
    attr(res,"data") &lt;- attr(e1,"data")
    attr(res,"before") &lt;- attr(e1,"before")
    attr(res,"after") &lt;- attr(e1,"after")
    attr(res,"numberOfSites") &lt;- attr(e1,"numberOfSites")
    attr(res,"call") &lt;- match.call()
    class(res) &lt;- "events"
    res
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org89305e0">plot.events &lt;- function(x,
                        y=NULL,
                        evts.lwd = 0.1,
                        medAndMad = TRUE,
                        evts.col = "black",
                        med.col = "red",
                        mad.col = "blue",
                        x.bar = NULL,
                        y.bar = NULL) {

    nsites &lt;- attr(x,"numberOfSites")
    ne &lt;- dim(x)[2]
    cl &lt;- dim(x)[1]/nsites
    ylim &lt;- range(x)
    matplot(x,type="n",xlab="",ylab="",axes=FALSE,ylim=ylim)
    if (nsites &gt; 1) {
        ii &lt;- 2*(1:(nsites %/% 2))
        rect((ii-1)*cl,ylim[1],ii*cl,ylim[2],col="grey80",border=NA)
    }
    matlines(x,col=evts.col,lty=1,lwd=evts.lwd)
    if (medAndMad) {
        med &lt;- apply(x,1,median)
        mad &lt;- apply(x,1,mad)
        lines(med,col=med.col)
        lines(mad,col=mad.col)
    }
    if (!is.null(x.bar)) segments(x0=0,y0=ylim[1]+0.1*diff(ylim),x1=x.bar)
    if (!is.null(y.bar)) segments(x0=0,y0=ylim[1]+0.1*diff(ylim),y1=ylim[1]+0.1*diff(ylim)+y.bar)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org5011b19">lines.events &lt;- function(x,
                         evts.lwd = 0.1,
                         evts.col = "black",
                         ...
                         ) {
    matlines(x,col=evts.col,lty=1,lwd=evts.lwd,...)
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-R" id="org45730f1">print.events &lt;- function(x, 
                         ... ) {
    plot.events(x,...)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf01ff42" class="outline-4">
<h4 id="orgf01ff42"><span class="section-number-4">2.1.8</span> <code>mkNoise</code> definition</h4>
<div class="outline-text-4" id="text-2-1-8">
<div class="org-src-container">
<pre class="src src-R" id="org66c3a11">mkNoise &lt;- function(positions,
                    data,
                    before=14,
                    after=30,
                    safetyFactor=2,
                    size=2000) {
    positions &lt;- unclass(positions)
    data &lt;- unclass(data)
    if (!is.matrix(data)) data &lt;- matrix(data,nc=1)
    size &lt;- as.integer(size)
    stopifnot(0 &lt; size) ## make sure size is a positive integer
    sl &lt;- before+after+1
    ns &lt;- dim(data)[2]
    i1 &lt;- diff(positions) ## inter events intervals
    nbI &lt;- (i1-round(safetyFactor*sl))%/%sl ## number of noise sweeps
    ## one can cut from each
    ## interval
    nbPossible &lt;- min(size,
                      sum((nbI)[nbI&gt;0])
                      )
    ## allocate next the memory for the noise events
    noiseMatrix &lt;- matrix(0,
                          nr=ns*sl,
                          nc=nbPossible
                          )
    
    iV &lt;- (1:length(i1))[nbI&gt;0] ## A vector containing the indexes of
    ## the (inter event) intervals from
    ## which at least one noise sweep can be
    ## cut.
    iIdx &lt;- 1 ## an index running over the inter event intervals from
    ## which noise events can be cut.
    nInI &lt;- nbI[iV[iIdx]] ## the number of noise sweeps that can be cut
    ## from the "non empty" inter event interval
    ## iV[iIdx].
    nIdx &lt;- 1 ## An index running over the noise sweeps.
    noisePositions &lt;- integer(nbPossible)
    while (nIdx &lt;= nbPossible) {
        uInI &lt;- 1 ## An index running over the noise sweeps that will be
        ## cut from a given "non empty" inter event interval.
        iPos &lt;- positions[iV[iIdx]] + round(safetyFactor*sl)
        noisePositions[nIdx] &lt;- iPos
        while (uInI &lt;= nInI &amp; 
               nIdx &lt;= nbPossible
               ) {
            ii &lt;- (-before:after) + iPos
            ns &lt;- as.vector(data[ii,])
            noiseMatrix[,nIdx] &lt;- ns
            nIdx &lt;- nIdx + 1
            iPos &lt;- iPos + sl
            uInI &lt;- uInI + 1
        } ## End of while loop on uInI
        iIdx &lt;- iIdx + 1
        nInI &lt;- nbI[iV[iIdx]]
    } ## End of while loop on nIdx

    the.call &lt;- match.call()
    attr(noiseMatrix,"positions") &lt;- noisePositions
    attr(noiseMatrix,"delta") &lt;- NULL
    attr(noiseMatrix,"data") &lt;- the.call[["data"]]
    attr(noiseMatrix,"before") &lt;- before
    attr(noiseMatrix,"after") &lt;- after
    attr(noiseMatrix,"numberOfSites") &lt;- ifelse(is.matrix(data),dim(data)[2],1)
    attr(noiseMatrix,"call") &lt;- match.call()
    class(noiseMatrix) &lt;- "events"
    noiseMatrix
}
</pre>
</div>
</div>
</div>
