R_Sorting_Code/sorting_with_r.html

<div id="outline-container-org2979fa9" class="outline-4">
<h4 id="org2979fa9"><span class="section-number-4">2.1.9</span> Definition of an <code>explore</code> method for <code>pca</code> results</h4>
<div class="outline-text-4" id="text-2-1-9">
<div class="org-src-container">
<pre class="src src-R" id="orgcbad540">explore.prcomp &lt;- function(x,
                           pc=1, ##&lt;&lt; an integer: the pc index to add to the mean.
                           factor=2, ##&lt;&lt; a numeric, the scaling factor; that is, the plot shows mean +/- factor * pc.
                           m.col="black", ##&lt;&lt; a character string or an integer, the color used for mean.
                           u.col="red", ##&lt;&lt; a character string or an integer, the color used for mean + factor * pc.
                           l.col="blue", ##&lt;&lt; a character string or an integer, the color used for mean - factor * pc.
                           xlab="Index", ##&lt;&lt; a character string with the abscissa label.
                           ylab="Amplitude", ##&lt;&lt; a character string with the ordinate label.
                           main, ##&lt;&lt; a character string with the title. If 'missing' (default) one is automatically generated.
                           ... ##&lt;&lt; additional arguments passed to 'plot'.
                           ) {
    if (missing(main)) {
        w &lt;- x$sdev[pc]^2/sum(x$sdev^2)
        main &lt;- paste("PC ",pc," (",round(100*w,digits=1),"%)",sep="")
    }
    u &lt;- x$center + factor * x$rotation[,pc]
    l &lt;- x$center - factor * x$rotation[,pc]
    ylim=range(c(l,u))
    plot(x$center,type="l",xlab=xlab,ylab=ylab,col=m.col,main=main,ylim=ylim,...)
    lines(u,col=u.col,...)
    lines(l,col=l.col,...)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org0f10f85" class="outline-4">
<h4 id="org0f10f85"><span class="section-number-4">2.1.10</span> Definition of <code>get_jitter</code></h4>
<div class="outline-text-4" id="text-2-1-10">
<p>
We define  a function that estimates the jitter given:
</p>
<ul class="org-ul">
<li><code>evts</code>: an event&#x2014;or a matrix of events where individual events form the columns.</li>
<li><code>center</code>: the 'central' (median) event on which the alignment will be performed.</li>
<li><code>centerD</code>: the first derivative of the central event.</li>
<li><code>centerDD</code>: the second derivative of the central event.</li>
</ul>
<p>
The functions returns a vector of estimated jitters giving the amount of sampling points by which the central event should be shifted in order to best match each individual events.
This sampling jitter estimation is performed by a two stages procedure:
</p>
<ol class="org-ol">
<li>Linear regression is first used get a first jitter estimation based on a first order Taylor expansion.</li>
<li>A Newton-Raphson step is used to refine the first estimation (used as a starting point) based on a second order Taylor expansion.</li>
</ol>
<div class="org-src-container">
<pre class="src src-R" id="orgaadc6bc">get_jitter &lt;- function(evts,
                       center,
                       centerD,
                       centerDD){
    
    centerD_norm2 &lt;- sum(centerD^2)
    centerDD_norm2 &lt;- sum(centerDD^2)
    centerD_dot_centerDD &lt;- sum(centerD*centerDD)
    
    if (is.null(dim(evts))) evts &lt;- matrix(evts, nc=1)
    
    evts &lt;- evts - center
    h_dot_centerD &lt;- centerD %*% evts 
    delta0 &lt;- h_dot_centerD/centerD_norm2
    h_dot_centerDD &lt;- centerDD %*% evts
    first &lt;- -2*h_dot_centerD + 2*delta0*(centerD_norm2 - h_dot_centerDD) + 3*delta0^2*centerD_dot_centerDD + delta0^3*centerDD_norm2 
    second &lt;- 2*(centerD_norm2 - h_dot_centerDD) + 6*delta0*centerD_dot_centerDD + 3*delta0^2*centerDD_norm2
    as.vector(delta0 - first/second)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb00920e" class="outline-4">
<h4 id="orgb00920e"><span class="section-number-4">2.1.11</span> Definition of <code>mk_aligned_events</code></h4>
<div class="outline-text-4" id="text-2-1-11">
<p>
We define a function taking a vector of spike times, that should all come from the same cluster and correspond to reasonably "clean" events, and three arguments corresponding to the last three arguments of <code>mkEvents</code>, the function returns a <code>events</code> object. The <code>positions</code> attribute of the returned object gives the nearest sampling point to the actual peak. The <code>delta</code> attribute gives the offset between the previous spike position and the "actual" peak position (the actual position is attribute <code>positions</code> <b>minus</b> attribute <code>delta</code>):
</p>
<div class="org-src-container">
<pre class="src src-R" id="orgc2730ee">mk_aligned_events &lt;- function(positions,
                              data,
                              before=14,
                              after=30){
    dataD = apply(data,2,function(x) c(0,diff(x,2)/2,0))
    dataDD = apply(dataD,2,function(x) c(0,diff(x,2)/2,0))
    evts = mkEvents(positions, data, before, after)
    evtsD = mkEvents(positions, dataD, before, after)
    evtsDD = mkEvents(positions, dataDD, before, after)
    evts_median = apply(evts,1,median)
    evtsD_median = apply(evtsD,1,median)
    evtsDD_median = apply(evtsDD,1,median)
    evts_jitter = get_jitter(evts,evts_median,evtsD_median,evtsDD_median)
    ## positions = positions-[round(x.item(0)) for x in np.nditer(evts_jitter)]
    positions = positions-round(evts_jitter)
    evts = mkEvents(positions, data, before, after)
    evtsD = mkEvents(positions, dataD, before, after)
    evtsDD = mkEvents(positions, dataDD, before, after)
    evts_median = apply(evts,1,median)
    evtsD_median = apply(evtsD,1,median)
    evtsDD_median = apply(evtsDD,1,median)
    evts_jitter = get_jitter(evts,evts_median,evtsD_median,evtsDD_median)
    res = unclass(evts) - evtsD_median %o% evts_jitter - evtsDD_median %o% evts_jitter^2/2
    attributes(res) = attributes(evts)
    attr(res,"positions") &lt;-  positions
    attr(res,"call") &lt;- match.call()
    attr(res,"delta") &lt;- evts_jitter
    res
}
</pre>
</div>
</div>
</div>
