R_Sorting_Code/sorting_with_r.html

<div id="outline-container-orgaaf9f29" class="outline-4">
<h4 id="orgaaf9f29"><span class="section-number-4">2.1.12</span> Definition of <code>mk_center_list</code></h4>
<div class="outline-text-4" id="text-2-1-12">
<p>
We define function <code>mk_center_list</code> that given:
</p>
<ul class="org-ul">
<li><code>positions</code>, a vector of spike times, that should all come from the same cluster and correspond to reasonably "clean" events,</li>
<li><code>data</code>, a data matrix,</li>
<li><code>before</code>, the number of sampling point to keep before the peak,</li>
<li><code>after</code>, the number of sampling point to keep after the peak,</li>
</ul>
<p>
returns a nammed list with the following elements and their content:
</p>
<ul class="org-ul">
<li><code>center</code>: the estimate of the center (obtained from the median),</li>
<li><code>centerD</code>: the estimate of the center's derivative (obtained from the median of events cut on the derivative of data),</li>
<li><code>centerDD</code>: the estimate of the center's second derivative (obtained from the median of events cut on the second derivative of data),</li>
<li><code>centerD_norm2</code>: the squared norm of the center's derivative,</li>
<li><code>centerDD_norm2</code>: the squared norm of the center's second derivative,</li>
<li><code>centerD_dot_centerDD</code>: the scalar product of the center's first and second derivatives,</li>
<li><code>center_idx</code>: an array of indices going from <code>-before</code> to <code>after</code>.</li>
</ul>
<p>
The peeling procedure, requiers, for each cluster, estimates of its center and of its first two derivatives. Clusters' centers must moreover be built such that they can be used for subtraction, this implies that we should make them long enough, on both side of the peak, to see them go back to baseline. Formal parameters <code>before</code> and <code>after</code> should therefore be set to larger values than the ones used for clustering.
</p>
<div class="org-src-container">
<pre class="src src-R" id="org8a027f4">mk_center_list = function(positions,
                           data,
                           before=49,
                           after=80) {
    dataD = apply(data,2,function(x) c(0,diff(x,2)/2,0))
    dataDD = apply(dataD,2,function(x) c(0,diff(x,2)/2,0))
    evts = mkEvents(positions, data, before, after)
    evtsD = mkEvents(positions, dataD, before, after)
    evtsDD = mkEvents(positions, dataDD, before, after)
    evts_median = apply(evts,1,median)
    evtsD_median = apply(evtsD,1,median)
    evtsDD_median = apply(evtsDD,1,median)
    list("center" = evts_median, 
         "centerD" = evtsD_median, 
         "centerDD" = evtsDD_median, 
         "centerD_norm2" = sum(evtsD_median^2),
         "centerDD_norm2" = sum(evtsDD_median^2),
         "centerD_dot_centerDD" = sum(evtsD_median*evtsDD_median), 
         "center_idx" = -before:after)
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb10176c" class="outline-4">
<h4 id="orgb10176c"><span class="section-number-4">2.1.13</span> Definition of <code>classify_and_align_evt</code></h4>
<div class="outline-text-4" id="text-2-1-13">
<p>
The formal parameters of <code>classify_and_align_evt</code> are:
</p>
<ul class="org-ul">
<li>a set of events' positions,</li>
<li>a data matrix containing the raw (but normalized data),</li>
<li>a named list of centers,</li>
<li>arguments <code>before</code> and <code>after</code> corresponding to arguments with those names in <code>mk_center_list</code>,</li>
</ul>
<p>
returns a list with the following element:
</p>
<ul class="org-ul">
<li>the name of the closest center in terms of Euclidean distance or "?" if none of the clusters' waveform does better than a uniformly null one,</li>
<li>the new position of the event (the previous position corrected by the integer part of the estimated jitter),</li>
<li>the remaining jitter.</li>
</ul>
<div class="org-src-container">
<pre class="src src-R" id="orge9c5bd5">classify_and_align_evt &lt;- function(evt_pos,
                                   data,
                                   centers,
                                   before=14,
                                   after=30
                                   ){
    cluster_names = names(centers)
    n_sites = dim(data)[2]
    centersM = sapply(cluster_names,
        function(cn) centers[[cn]][["center"]][rep(-before &lt;= centers[[cn]][["center_idx"]] &amp;
                                                   centers[[cn]][["center_idx"]] &lt;= after,
                                                   n_sites)])
    
    evt = cutSglEvt(evt_pos,data=data,before=before, after=after)
    delta = -(centersM - evt)
    cluster_idx = which.min(apply(delta^2,2,sum))
    good_cluster_name = cluster_names[cluster_idx]
    good_cluster_idx = rep(-before &lt;= centers[[good_cluster_name]][["center_idx"]] &amp;
        centers[[good_cluster_name]][["center_idx"]] &lt;= after,
        n_sites)
    centerD = centers[[good_cluster_name]][["centerD"]][good_cluster_idx]
    centerD_norm2 = sum(centerD^2)
    centerDD = centers[[good_cluster_name]][["centerDD"]][good_cluster_idx]
    centerDD_norm2 = sum(centerDD^2)
    centerD_dot_centerDD = sum(centerD*centerDD)
    h = delta[,cluster_idx]
    h_order0_norm2 = sum(h^2)
    h_dot_centerD = sum(h*centerD)
    jitter0 = h_dot_centerD/centerD_norm2
    h_order1_norm2 = sum((h-jitter0*centerD)^2) 
    if (h_order0_norm2 &gt; h_order1_norm2) {
        h_dot_centerDD = sum(h*centerDD)
        first = -2*h_dot_centerD + 2*jitter0*(centerD_norm2 - h_dot_centerDD) +
            3*jitter0^2*centerD_dot_centerDD + jitter0^3*centerDD_norm2
        second = 2*(centerD_norm2 - h_dot_centerDD) + 6*jitter0*centerD_dot_centerDD + 
            3*jitter0^2*centerDD_norm2
        jitter1 = jitter0 - first/second
        h_order2_norm2 = sum((h-jitter1*centerD-jitter1^2/2*centerDD)^2)
        if (h_order1_norm2 &lt;= h_order2_norm2) {
            jitter1 = jitter0
        }
    } else {
        jitter1 = 0
    }
    if (abs(round(jitter1)) &gt; 0) {
        evt_pos = evt_pos - round(jitter1)
        evt = cutSglEvt(evt_pos,data=data,before=before, after=after)
        h = evt - centers[[good_cluster_name]][["center"]][good_cluster_idx]
        h_order0_norm2 = sum(h^2)
        h_dot_centerD = sum(h*centerD)
        jitter0 = h_dot_centerD/centerD_norm2
        h_order1_norm2 = sum((h-jitter0*centerD)^2) 
        if (h_order0_norm2 &gt; h_order1_norm2) {
            h_dot_centerDD = sum(h*centerDD)
            first = -2*h_dot_centerD + 2*jitter0*(centerD_norm2 - h_dot_centerDD) + 
                3*jitter0^2*centerD_dot_centerDD + jitter0^3*centerDD_norm2
            second = 2*(centerD_norm2 - h_dot_centerDD) + 6*jitter0*centerD_dot_centerDD + 
                3*jitter0^2*centerDD_norm2
            jitter1 = jitter0 - first/second
            h_order2_norm2 = sum((h-jitter1*centerD-jitter1^2/2*centerDD)^2)
            if (h_order1_norm2 &lt;= h_order2_norm2) {
                jitter1 = jitter0
            }
        } else {
            jitter1 = 0
        }
    }
    if (sum(evt^2) &gt; sum((h-jitter1*centerD-jitter1^2/2*centerDD)^2)) 
        return(list(cluster_names[cluster_idx], evt_pos, jitter1))
    else 
        return(list('?',evt_pos, jitter1))
}
</pre>
</div>
</div>
</div>
