R_Sorting_Code/sorting_with_r.org
*** Definition of =predict_data=
The formal parameters of =predict_data= are:
+ =class_pos_jitter_list=:  a list of lists. Each sub-list corresponds to a single detected event and as three components: the cluster of origin (or "?" if none was found), the position and the jitter.
+ =centers_list=: a list of list. Each sub-list is the result of a call to =mk_center_list=.
+ =nb_channels=: an integer, the number of recording channels.
+ =data_length=: an integer, the length of the data.
The function returns a matrix with =data_length= rows and =nb_channels= columns with observations predictions based on =class_pos_jitter_list= and =centers_list=.  
#+name: predict_data
#+BEGIN_SRC R 
predict_data <- function(class_pos_jitter_list,
                         centers_list,
                         nb_channels=4,
                         data_length=300000) {
    
    res = matrix(0,nc=nb_channels, nr=data_length)
    for (class_pos_jitter in class_pos_jitter_list) {
        cluster_name = class_pos_jitter[[1]]
        if (cluster_name != '?') {
            center = centers_list[[cluster_name]][["center"]]
            centerD = centers_list[[cluster_name]][["centerD"]]
            centerDD = centers_list[[cluster_name]][["centerDD"]]
            jitter = class_pos_jitter[[3]]
            pred = center + jitter*centerD + jitter^2/2*centerDD
            pred = matrix(pred,nc=nb_channels)
            idx = centers_list[[cluster_name]][["center_idx"]] + class_pos_jitter[[2]]
            within = 0 < idx & idx <= data_length
            kw = idx[within]
            res[kw,] = res[kw,] + pred[within,]
        }
    }
    res
}

#+END_SRC

#+RESULTS: predict_data

** Put everything in one =R= file :noexport:
#+name: sorting_with_r
#+BEGIN_SRC R :noweb yes :tangle sorting_with_r.R
<<cstValueSgts>>
<<explore-generic>>
<<explore.ts>>
<<peaks-definition>>
<<as.eventsPos>>
<<print.eventsPos>>
<<explore.eventsPos>>
<<cutSglEvt>>
<<mkEvents>>
<<summary.events>>
<<events-subsetting>>
<<transpose-events>>
<<mean-and-median-for-events>>
<<subtract-vector-from-events>>
<<plot.events>>
<<lines.events>>
<<print.events>>
<<mkNoise>>
<<explore.prcomp>>
<<get-jitter>>
<<mk_aligned_events>>
<<mk_center_list>>
<<classify_and_align_evt>>
<<predict_data>>
#+END_SRC
