R_Sorting_Code/sorting_with_r.html

<div id="outline-container-org785a74d" class="outline-4">
<h4 id="org785a74d"><span class="section-number-4">2.1.14</span> Definition of <code>predict_data</code></h4>
<div class="outline-text-4" id="text-2-1-14">
<p>
The formal parameters of <code>predict_data</code> are:
</p>
<ul class="org-ul">
<li><code>class_pos_jitter_list</code>:  a list of lists. Each sub-list corresponds to a single detected event and as three components: the cluster of origin (or "?" if none was found), the position and the jitter.</li>
<li><code>centers_list</code>: a list of list. Each sub-list is the result of a call to <code>mk_center_list</code>.</li>
<li><code>nb_channels</code>: an integer, the number of recording channels.</li>
<li><code>data_length</code>: an integer, the length of the data.</li>
</ul>
<p>
The function returns a matrix with <code>data_length</code> rows and <code>nb_channels</code> columns with observations predictions based on <code>class_pos_jitter_list</code> and <code>centers_list</code>.  
</p>
<div class="org-src-container">
<pre class="src src-R" id="org5dc3308">predict_data &lt;- function(class_pos_jitter_list,
                         centers_list,
                         nb_channels=4,
                         data_length=300000) {
    
    res = matrix(0,nc=nb_channels, nr=data_length)
    for (class_pos_jitter in class_pos_jitter_list) {
        cluster_name = class_pos_jitter[[1]]
        if (cluster_name != '?') {
            center = centers_list[[cluster_name]][["center"]]
            centerD = centers_list[[cluster_name]][["centerD"]]
            centerDD = centers_list[[cluster_name]][["centerDD"]]
            jitter = class_pos_jitter[[3]]
            pred = center + jitter*centerD + jitter^2/2*centerDD
            pred = matrix(pred,nc=nb_channels)
            idx = centers_list[[cluster_name]][["center_idx"]] + class_pos_jitter[[2]]
            within = 0 &lt; idx &amp; idx &lt;= data_length
            kw = idx[within]
            res[kw,] = res[kw,] + pred[within,]
        }
    }
    res
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Christophe Pouzat</p>
<p class="date">Created: 2016-12-08 jeu. 20:59</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
